<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/DBMS_BASIC_CRUD_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## SQL Queries
1. DDL Queries
    - CREATE TABLE
2. CRUD Operations (DML Queries)
    - INSERT
    - SELECT
    - UPDATE
    - DELETE

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
 conn=sql.connect('DBMS_Class_database.db')

Create a table for student information of MTech.

In [4]:
conn.execute('''Create table student_MTech 
(id integer primary key not null,
Student_Name char(20) not null, 
Class_and_section varchar, 
Mid_Semester_Marks integer,
End_Semester_Marks integer)''')

In [5]:
pd.read_sql("SELECT * FROM student_MTech", conn)

Empty DataFrame
Columns: [id, Student_Name, Class_and_section, Mid_Semester_Marks, End_Semester_Marks]
Index: []

In [6]:
def insert_Postgraduatecoursestudent (id, Student_Name, Class_and_section, Mid_Semester_Marks, End_Semester_Marks): 
    query="Insert into student_MTech values (?,?,?,?,?);" 
    conn.execute(query,(id, Student_Name, Class_and_section, Mid_Semester_Marks, End_Semester_Marks)) 
    conn.commit()

In [7]:
insert_Postgraduatecoursestudent (120641,"Cetal", "T1Group", 60,70)
insert_Postgraduatecoursestudent (120642,"Kbridge","T2Group",45,60)
insert_Postgraduatecoursestudent (120643,"Track","T3Group",90,100)

insert_Postgraduatecoursestudent (120644,"Ietal", "T1Group", 60,70)
insert_Postgraduatecoursestudent (120645,"Bettle","T2Group",45,60)
insert_Postgraduatecoursestudent (120646,"Volkswagen","T3Group",90,100)

In [8]:
for row in conn.execute("Select * from student_MTech"):
    print(row)

(120641, 'Cetal', 'T1Group', 60, 70)
(120642, 'Kbridge', 'T2Group', 45, 60)
(120643, 'Track', 'T3Group', 90, 100)
(120644, 'Ietal', 'T1Group', 60, 70)
(120645, 'Bettle', 'T2Group', 45, 60)
(120646, 'Volkswagen', 'T3Group', 90, 100)

In [9]:
pd.read_sql("SELECT * FROM student_MTech", conn)

       id Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120641        Cetal  ...                 60                  70
1  120642      Kbridge  ...                 45                  60
2  120643        Track  ...                 90                 100
3  120644        Ietal  ...                 60                  70
4  120645       Bettle  ...                 45                  60
5  120646   Volkswagen  ...                 90                 100

[6 rows x 5 columns]

Create a table for student information of BTech.

In [11]:
conn.execute('''Create table student_BTech 
(ID integer primary key not null,
Student_Name char(20) not null, 
Class_and_section varchar, 
Mid_Semester_Marks integer,
End_Semester_Marks integer)''')

In [12]:
def insert_Undergraduatecoursestudent (ID, Student_Name, Class_and_section, Mid_Semester_Marks,End_Semester_Marks): 
    query="Insert into student_BTech (ID, Student_Name, Class_and_section, Mid_Semester_Marks, End_Semester_Marks) values(?,?,?,?,?);" 
    conn.execute(query,(ID, Student_Name, Class_and_section, Mid_Semester_Marks, End_Semester_Marks)) 
    conn.commit()

In [13]:
insert_Undergraduatecoursestudent (120641,"Reka", "T1Group", 60, 70)
insert_Undergraduatecoursestudent (120642,"Galvin","T2Group",45, 60)
insert_Undergraduatecoursestudent (120643,"Sia","TA",90,100)
insert_Undergraduatecoursestudent (120644, "Siajajska","T2Group",90,100)

In [14]:
for row in conn.execute("Select * from student_BTech"):
    print(row)

(120641, 'Reka', 'T1Group', 60, 70)
(120642, 'Galvin', 'T2Group', 45, 60)
(120643, 'Sia', 'TA', 90, 100)
(120644, 'Siajajska', 'T2Group', 90, 100)

Show details of all students.

In [15]:
pd.read_sql("SELECT * FROM student_BTech UNION SELECT * FROM student_MTech", conn)

       ID Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120641        Cetal  ...                 60                  70
1  120641         Reka  ...                 60                  70
2  120642       Galvin  ...                 45                  60
3  120642      Kbridge  ...                 45                  60
4  120643          Sia  ...                 90                 100
5  120643        Track  ...                 90                 100
6  120644        Ietal  ...                 60                  70
7  120644    Siajajska  ...                 90                 100
8  120645       Bettle  ...                 45                  60
9  120646   Volkswagen  ...                 90                 100

[10 rows x 5 columns]

In [16]:
from IPython.display import display

print("B.Tech Students")
display(pd.read_sql("SELECT * FROM student_BTech", conn))

print("M.Tech Students")
display(pd.read_sql("SELECT * FROM student_MTech", conn))

B.Tech Students

       ID Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120641         Reka  ...                 60                  70
1  120642       Galvin  ...                 45                  60
2  120643          Sia  ...                 90                 100
3  120644    Siajajska  ...                 90                 100

[4 rows x 5 columns]

M.Tech Students

       id Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120641        Cetal  ...                 60                  70
1  120642      Kbridge  ...                 45                  60
2  120643        Track  ...                 90                 100
3  120644        Ietal  ...                 60                  70
4  120645       Bettle  ...                 45                  60
5  120646   Volkswagen  ...                 90                 100

[6 rows x 5 columns]

Find the total number of students in MTech.

In [17]:
query = """
SELECT COUNT(*) FROM student_MTech
"""

pd.read_sql(query, conn)

   COUNT(*)
0         6

The total number of students in BTech.

In [18]:
query = """
SELECT COUNT(*) FROM student_BTech
"""

pd.read_sql(query, conn)

   COUNT(*)
0         4

Show list of T2 students in ascending order of name.

In [19]:
query = """
SELECT * FROM student_BTech WHERE Class_and_section = 'T2Group'
ORDER BY Student_Name
"""

pd.read_sql(query, conn)

       ID Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120642       Galvin  ...                 45                  60
1  120644    Siajajska  ...                 90                 100

[2 rows x 5 columns]

Number of Students in T1Group, T2Group and T3Group for MTech students.

In [20]:
query = """
SELECT Class_and_section, COUNT(*) FROM student_MTech GROUP BY Class_and_section
"""

pd.read_sql(query, conn)

  Class_and_section  COUNT(*)
0           T1Group         2
1           T2Group         2
2           T3Group         2

Shift all T2 students to T3 group in case to MTech students.

In [26]:
query = """
UPDATE student_MTech SET Class_and_section = 'T3Group' WHERE Class_and_section = 'T2Group'
"""

conn.execute(query)
conn.commit()

pd.read_sql("SELECT * FROM student_MTech", conn)

       id Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120641        Cetal  ...                 60                  70
1  120642      Kbridge  ...                 45                  60
2  120643        Track  ...                 90                 100
3  120644        Ietal  ...                 60                  70
4  120645       Bettle  ...                 45                  60
5  120646   Volkswagen  ...                 90                 100

[6 rows x 5 columns]

Remove all students who are in T2 group of BTech.

In [29]:
query = """
DELETE FROM student_BTech WHERE Class_and_section = 'T2group'
"""

conn.execute(query)
conn.commit()

pd.read_sql("SELECT * FROM student_BTech", conn)

       ID Student_Name  ... Mid_Semester_Marks  End_Semester_Marks
0  120641         Reka  ...                 60                  70
1  120642       Galvin  ...                 45                  60
2  120643          Sia  ...                 90                 100
3  120644    Siajajska  ...                 90                 100

[4 rows x 5 columns]